{
  "date": "2025-07-09",
  "summaries": [
    {
      "title": "Prime Minister meets with the President of Brazil",
      "ministry": "Prime Minister's Office",
      "summary": "- Prime Minister of India met with the President of Brazil.\n- They discussed strengthening bilateral relations between India and Brazil.\n- Focus on cooperation in trade, investment, and technology.\n- Both leaders emphasized the importance of sustainable development.\n- They agreed to enhance collaboration in international forums.",
      "tags": [
        "prime-minister's-office"
      ]
    },
    {
      "title": "Joint Statement: India and Brazil - Two Great Nations with Higher Purposes",
      "ministry": "Prime Minister's Office",
      "summary": "- India and Brazil reaffirm their partnership and commitment to global cooperation.  \n- Both countries aim to enhance trade, investment, and sustainable development.  \n- They focus on addressing climate change and promoting renewable energy.  \n- India and Brazil support multilateralism and strengthening international institutions.  \n- The nations emphasize cultural exchange and people-to-people connections.",
      "tags": [
        "prime-minister's-office",
        "india"
      ]
    },
    {
      "title": "List of Outcomes: State Visit of Prime Minister to Brazil",
      "ministry": "Prime Minister's Office",
      "summary": "- The Prime Minister of India visited Brazil to strengthen bilateral relations.\n- Key discussions included trade, investment, and technology cooperation.\n- India and Brazil agreed to enhance collaboration in agriculture and climate change.\n- A joint statement was issued to outline the outcomes of the visit.\n- Both countries emphasized the importance of multilateralism and global governance.",
      "tags": [
        "prime-minister's-office"
      ]
    },
    {
      "title": "Prime Minister conferred with the highest national honour of Brazil – “The Grand Collar of the National Order of the Southern Cross”",
      "ministry": "Prime Minister's Office",
      "summary": "- Prime Minister of India received Brazil's highest honor, \"The Grand Collar of the National Order of the Southern Cross.\"\n- The award recognizes his contributions to strengthening India-Brazil relations.\n- The ceremony took place during his official visit to Brazil.\n- This honor highlights India's growing international influence.\n- It reflects the importance of bilateral ties between India and Brazil.",
      "tags": [
        "prime-minister's-office"
      ]
    },
    {
      "title": "English Translation of Press Statement by Prime Minister during Joint Press Statement with the President of Brazil",
      "ministry": "Prime Minister's Office",
      "summary": "- Prime Minister held a joint press statement with Brazil's President.  \n- Both leaders discussed strengthening bilateral ties between India and Brazil.  \n- They emphasized cooperation in trade, investment, and technology.  \n- The importance of cultural exchange and people-to-people connections was highlighted.  \n- Both countries committed to working together on global challenges.",
      "tags": [
        "prime-minister's-office"
      ]
    },
    {
      "title": "Curtain Raiser National Fish Farmers Day 2025",
      "ministry": "Ministry of Fisheries, Animal Husbandry & Dairying",
      "summary": "- National Fish Farmers Day will be celebrated on July 10, 2025.\n- The event aims to promote fish farming and its benefits.\n- It will highlight the achievements of fish farmers in India.\n- The day will focus on sustainable aquaculture practices.\n- Various activities and programs will be organized to raise awareness.",
      "tags": [
        "technology",
        "fisheries,-animal-husbandry-and-dairying"
      ]
    }
  ]
}