{
  "date": "2025-07-08",
  "summaries": [
    {
      "title": "Digital Platforms Driving Efficiency and Accountability in Agricultural Schemes, says Agriculture Secretary Dr Devesh Chaturvedi",
      "ministry": "Ministry of Agriculture &\r\nFarmers Welfare",
      "summary": "- Digital platforms are improving efficiency in agricultural schemes.\n- Agriculture Secretary Dr. Devesh Chaturvedi highlighted the importance of these technologies.\n- The use of digital tools enhances accountability in managing agricultural programs.\n- The initiative aims to benefit farmers and streamline government processes.\n- Increased transparency is a key goal of these digital efforts.",
      "tags": [
        "agriculture-and\r\nfarmers-welfare",
        "welfare"
      ]
    },
    {
      "title": "From Abandonment to Opportunity: BCCL Revives Legacy Coal Mine via MDO Model",
      "ministry": "Ministry of Coal",
      "summary": "- BCCL (Bharat Coking Coal Limited) is reviving an abandoned coal mine using the MDO (Mine Developer and Operator) model.  \n- This initiative aims to enhance coal production and create job opportunities.  \n- The project focuses on sustainable mining practices and efficient resource management.  \n- The revival will help meet the increasing demand for coal in India.  \n- It aligns with the government's efforts to boost the coal sector and promote economic growth.",
      "tags": [
        "coal",
        "ministry of defence"
      ]
    },
    {
      "title": "“The Indian Telecom Services Yearly Performance Indicators” for the year 2024-25",
      "ministry": "Ministry of Communications",
      "summary": "- The Indian Telecom Services report for 2024-25 was released by the Ministry of Communications.  \n- It highlights the growth and performance indicators of the telecom sector in India.  \n- The report shows an increase in mobile and internet users across the country.  \n- It emphasizes improvements in service quality and network coverage.  \n- The document aims to guide future policies and investments in the telecom industry.",
      "tags": [
        "india",
        "communications"
      ]
    },
    {
      "title": "IBC to Celebrate Āshāḍha Pūrṇimā – Dhammacakkappavattana Divas at Sarnath on 10 July",
      "ministry": "Ministry of Culture",
      "summary": "- The Ministry of Culture will celebrate Āshāḍha Pūrṇimā on July 10 in Sarnath.\n- This day is also known as Dhammacakkappavattana Divas, marking Buddha's first sermon.\n- The event aims to promote Buddhist teachings and cultural heritage.\n- Various activities and programs will be organized for the celebration.\n- The celebration highlights India's rich spiritual and cultural history.",
      "tags": [
        "event",
        "culture"
      ]
    },
    {
      "title": "Shri Dharmendra Pradhan and Shri Jayant Chaudhary inaugurate Uttar Pradesh Agritech Innovation Hub and Agritech Startup and Technology Showcase at SVPUAT, Meerut",
      "ministry": "Ministry of Education",
      "summary": "- Shri Dharmendra Pradhan and Shri Jayant Chaudhary opened the Uttar Pradesh Agritech Innovation Hub in Meerut.\n- The event includes an Agritech Startup and Technology Showcase.\n- It aims to promote innovation and technology in agriculture.\n- The hub will support startups in the agritech sector.\n- The initiative is part of efforts to boost agricultural productivity and sustainability.",
      "tags": [
        "education",
        "startup"
      ]
    },
    {
      "title": "No directions given to Banks to close inactive PM Jan Dhan Yojana accounts: Department of Financial Services, M/o Finance",
      "ministry": "Ministry of Finance",
      "summary": "- No orders have been issued to banks to close inactive PM Jan Dhan Yojana accounts.  \n- The Department of Financial Services clarified this information.  \n- The PM Jan Dhan Yojana aims to provide banking access to all citizens.  \n- Banks are encouraged to keep the accounts open to support financial inclusion.  \n- No specific guidelines for closing accounts have been provided.",
      "tags": [
        "finance",
        "banking"
      ]
    },
    {
      "title": "Start-Up Accelerator WaveX Launches “Kalaa Setu”, a nation-wide initiative inviting India’s leading AI startups to come up with a real-time multilingual multimedia content generation solution for prompt reach-out to citi...",
      "ministry": "Ministry of Information & Broadcasting",
      "summary": "- WaveX has launched \"Kalaa Setu\" to support AI startups in India.  \n- The initiative focuses on developing a real-time multilingual multimedia content generation solution.  \n- It aims to enhance communication and reach out to citizens effectively.  \n- The program is backed by the Ministry of Information & Broadcasting.  \n- Leading AI startups are invited to participate in this nationwide initiative.",
      "tags": [
        "technology",
        "information-and-broadcasting",
        "event"
      ]
    },
    {
      "title": "Ministry of Mines to organize ‘National District Mineral Foundation (DMF) Workshop’ and SHG Exhibition Tomorrow",
      "ministry": "Ministry of Mines",
      "summary": "- The Ministry of Mines will hold a 'National District Mineral Foundation (DMF) Workshop' and SHG Exhibition tomorrow.  \n- The event aims to discuss the role of DMF in mineral-rich districts.  \n- It will promote Self-Help Groups (SHGs) and their contributions to local development.  \n- The workshop will feature experts and stakeholders in the mining sector.  \n- This initiative supports sustainable mining practices and community welfare.",
      "tags": [
        "mines"
      ]
    },
    {
      "title": "Haj Committee of India opens application process for Haj 2026",
      "ministry": "Ministry of Minority Affairs",
      "summary": "- The Haj Committee of India has started accepting applications for Haj 2026.\n- The application process is open to Indian citizens.\n- Interested applicants can apply online through the Haj Committee's official website.\n- The last date for submitting applications is yet to be announced.\n- Applicants must meet specific eligibility criteria to participate.",
      "tags": [
        "governance",
        "minority-affairs",
        "india"
      ]
    },
    {
      "title": "Catalysing Solar Cooperation: ISA’s Seventh Regional Committee Meeting (RCM) for the Asia and the Pacific Region Set to Advance Regional Partnership",
      "ministry": "Ministry of New and Renewable Energy",
      "summary": "- The International Solar Alliance (ISA) held its Seventh Regional Committee Meeting for Asia and the Pacific.\n- The meeting aimed to strengthen solar energy cooperation among member countries.\n- Participants discussed strategies to enhance solar energy deployment and financing.\n- The event focused on sharing best practices and technologies in solar energy.\n- It supports regional partnerships for sustainable energy development.",
      "tags": [
        "event",
        "energy",
        "governance"
      ]
    },
    {
      "title": "NHAI Organises Plantation Drive along Faridabad-Noida International Airport Corridor",
      "ministry": "Ministry of Road Transport & Highways",
      "summary": "- NHAI organized a plantation drive along the Faridabad-Noida International Airport Corridor.  \n- The event aimed to enhance green cover and promote environmental awareness.  \n- Participants included local communities, students, and officials from the Ministry of Road Transport & Highways.  \n- The initiative supports the government's commitment to sustainable development.  \n- Thousands of saplings were planted during the drive.",
      "tags": [
        "technology",
        "environment",
        "road-transport-and-highways"
      ]
    },
    {
      "title": "54 KW Solar Power Plant inaugurated at Pt. Deendayal Upadhyaya National Institute for Persons with Physical Disabilities",
      "ministry": "Ministry of Social Justice & Empowerment",
      "summary": "- A 54 KW solar power plant was inaugurated at Pt. Deendayal Upadhyaya National Institute for Persons with Physical Disabilities.  \n- The inauguration was done by the Minister of Social Justice & Empowerment.  \n- The solar plant aims to promote renewable energy and support the institute’s energy needs.  \n- It reflects the government's commitment to sustainable development and empowerment of persons with disabilities.  \n- The project aligns with India's goals for clean energy and environmental sustainability.",
      "tags": [
        "energy",
        "social-justice-and-empowerment"
      ]
    }
  ]
}